// //////////////////////////////////////////////////////////////////////////////
// * 요약
//    - 스테이지 전용 코인 클래스
//    - 획득 시 스테이지 점수(Score) 기능 추가
//
// * 목차
//    1. 인터페이스 ... Line 19
//    2. 클래스 ....... Line 29
//        1) 필드 ..... Line 34
//        2) 메서드 ... Line 40
//            1- 초기화 ...... Line 43
//            2- 획득(Get) ... Line 53
// //////////////////////////////////////////////////////////////////////////////
using UnityEngine;

namespace Stage
{
    // //////////////////////////////////////////////////////////////////////////////
    // 1. 인터페이스(global::ICoinController 인터페이스 상속)
    // //////////////////////////////////////////////////////////////////////////////
    public interface ICoinController : global::ICoinController
    {
        // 프로퍼티
        // Reference
        IPlanetController planet { get; }
    }

    // //////////////////////////////////////////////////////////////////////////////
    // 2. 클래스(global::CoinController 클래스 상속)
    // //////////////////////////////////////////////////////////////////////////////
    public class CoinController : global::CoinController, ICoinController
    {
        // ==============================================================================
        // 1) 필드
        // ==============================================================================
        // Component & Reference
        public IPlanetController planet { get; protected set; }

        // ==============================================================================
        // 2) 메서드
        // ==============================================================================
        // ------------------------------------------------------------------------------
        // 2-1) 메서드 -> 초기화
        // ------------------------------------------------------------------------------
        protected override void SetField()
        {
            base.SetField();

            planet = GetComponentInParent<IPlanetController>(true);
        }

        // ------------------------------------------------------------------------------
        // 2-2) 메서드 -> 획득(Get)
        //    - 획득 시 스테이지의 점수(Score)를 갱신
        // ------------------------------------------------------------------------------
        public override Coroutine Get(global::IPlayerController player)
        {
            IScoreManager score = planet.level.stage.scene.score;

            score.IncreaseCoin();

            return base.Get(player);
        }
    }
}
