// //////////////////////////////////////////////////////////////////////////////
// * 요약
//    - 타이틀 씬의 메뉴 클래스
//
// * 목차
//    1. 인터페이스 ... Line 
//    2. 클래스 ....... Line 
//        1) 필드 ..... Line 
//        2) 메서드 ... Line 
//            1- 이벤트 함수 ... Line 
//            2- 초기화 ........ Line 
//            3- 열기(Open) .... Line 
// //////////////////////////////////////////////////////////////////////////////
using UnityEngine;

namespace Title
{
    // //////////////////////////////////////////////////////////////////////////////
    // 1. 인터페이스
    // //////////////////////////////////////////////////////////////////////////////
    public interface IMenuManager
    {
        // 프로퍼티
        // Component
        IMenuUIController ui { get; }

        // Reference
        ISceneDirector scene { get; }

        // 메서드
        void Initialize();
        void Open(bool isActive);
    }

    // //////////////////////////////////////////////////////////////////////////////
    // 2. 클래스
    // //////////////////////////////////////////////////////////////////////////////
    public class MenuManager : MonoBehaviour, IMenuManager
    {
        // ==============================================================================
        // 1) 필드
        // ==============================================================================
        public IMenuUIController ui    { get; protected set; }
        public ISceneDirector    scene { get; protected set; }

        // ==============================================================================
        // 2) 메서드
        // ==============================================================================
        // ------------------------------------------------------------------------------
        // 2-1) 메서드 -> 이벤트 함수
        // ------------------------------------------------------------------------------
        protected virtual void Awake() { SetField(); }

        // ------------------------------------------------------------------------------
        // 2-2) 메서드 -> 초기화
        // ------------------------------------------------------------------------------
        protected virtual void SetField()
        {
            ui    = GetComponentInChildren<IMenuUIController>(true);
            scene = GetComponentInParent<ISceneDirector>(true);
        }

        public virtual void Initialize()
        {
            gameObject.SetActive(true);
            ui.gameObject.SetActive(false);
        }

        // ------------------------------------------------------------------------------
        // 2-3) 메서드 -> 열기(Open)
        //    - UI 표시
        // ------------------------------------------------------------------------------
        public void Open(bool isActive) { ui.Display(true); }
    }
}
